HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/**
 * \file IfxDmu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Dmu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Dmu_Registers
 * 
 */
#ifndef IFXDMU_BF_H
#define IFXDMU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Dmu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_OFF (24u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_OFF (0u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_OFF (1u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_OFF (2u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_OFF (3u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_OFF (4u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_OFF (5u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_OFF (20u)

/** \brief Length for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_OFF (21u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.WSERRINJ */
#define IFX_DMU_HF_CONTROL_WSERRINJ_OFF (7u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_OFF (8u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_OFF (9u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_OFF (16u)

/** \brief Length for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_OFF (17u)

/** \brief Length for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_OFF (0u)

/** \brief Length for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_MSK (0x1u)

