HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_OFF (0u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_OFF (2u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_OFF (6u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_OFF (8u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_OFF (10u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_OFF (12u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_OFF (14u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_OFF (16u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_OFF (18u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_OFF (20u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_OFF (22u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_OFF (24u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_OFF (26u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_OFF (28u)

/** \brief Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_OFF (30u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_OFF (0u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_OFF (1u)

/** \brief Length for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_OFF (2u)

