HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_OFF (13u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_OFF (14u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_OFF (15u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_LEN (12u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_MSK (0xfffu)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_OFF (31u)

/** \brief Length for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_LEN (6u)

/** \brief Mask for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_MSK (0x3fu)

/** \brief Offset for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_LEN (7u)

/** \brief Mask for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_MSK (0x7fu)

/** \brief Offset for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_OFF (24u)

/** \brief Length for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_OFF (1u)

/** \brief Length for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_OFF (2u)

/** \brief Length for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_LEN (4u)

/** \brief Mask for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_MSK (0xfu)

/** \brief Offset for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_OFF (8u)

/** \brief Length for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_OFF (0u)

/** \brief Length for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_OFF (1u)

/** \brief Length for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_OFF (16u)

/** \brief Length for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_OFF (17u)

/** \brief Length for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_OFF (0u)

/** \brief Length for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_OFF (8u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN0 */
#define IFX_DMU_HF_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN0 */
#define IFX_DMU_HF_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN0 */
#define IFX_DMU_HF_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN1 */
#define IFX_DMU_HF_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN1 */
#define IFX_DMU_HF_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN1 */
#define IFX_DMU_HF_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN2 */
#define IFX_DMU_HF_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN2 */
#define IFX_DMU_HF_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN2 */
#define IFX_DMU_HF_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN3 */
#define IFX_DMU_HF_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN3 */
#define IFX_DMU_HF_ACCEN0_EN3_MSK (0x1u)

