HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN25 */
#define IFX_DMU_HF_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN26 */
#define IFX_DMU_HF_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN26 */
#define IFX_DMU_HF_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN26 */
#define IFX_DMU_HF_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN27 */
#define IFX_DMU_HF_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN27 */
#define IFX_DMU_HF_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN27 */
#define IFX_DMU_HF_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN28 */
#define IFX_DMU_HF_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN28 */
#define IFX_DMU_HF_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN28 */
#define IFX_DMU_HF_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN29 */
#define IFX_DMU_HF_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN29 */
#define IFX_DMU_HF_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN29 */
#define IFX_DMU_HF_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN30 */
#define IFX_DMU_HF_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN30 */
#define IFX_DMU_HF_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN30 */
#define IFX_DMU_HF_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_DMU_HF_ACCEN0_Bits.EN31 */
#define IFX_DMU_HF_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_ACCEN0_Bits.EN31 */
#define IFX_DMU_HF_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_ACCEN0_Bits.EN31 */
#define IFX_DMU_HF_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_P0_Bits.S18L */
#define IFX_DMU_HP_PROCON_P0_S18L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P0_Bits.S18L */
#define IFX_DMU_HP_PROCON_P0_S18L_MSK (0x1u)

