HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_OFF (29u)

