HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_OFF (0u)

/** \brief Length for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_OFF (1u)

/** \brief Length for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_OFF (0u)

/** \brief Length for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_OFF (1u)

/** \brief Length for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_OFF (3u)

/** \brief Length for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_OFF (4u)

/** \brief Length for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_OFF (31u)

/** \brief Length for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_OFF (0u)

/** \brief Length for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_OFF (1u)

/** \brief Length for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_OFF (3u)

/** \brief Length for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_OFF (4u)

/** \brief Length for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_OFF (1u)

/** \brief Length for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_OFF (3u)

/** \brief Length for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_OFF (4u)

/** \brief Length for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_LEN (22u)

/** \brief Mask for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_MSK (0x3fffffu)

/** \brief Offset for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_OFF (0u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_OFF (0u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_OFF (1u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_OFF (2u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_OFF (3u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_OFF (7u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_OFF (9u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_OFF (16u)

/** \brief Length for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_LEN (1u)

/** \brief Mask for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_OFF (17u)

